---
title: FabricationPartSizeMap
classe: Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap
namespace: Autodesk.Revit.DB.Fabrication
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 15
---

# FabricationPartSizeMap

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean AllowMultipleServiceSizes { get; set; }` | `fabricationPartSizeMap.AllowMultipleServiceSizes` | Boolean |
| `Double Depth { get; set; }` | `fabricationPartSizeMap.Depth` | Double |
| `Boolean IsMappedProductList { get; set; }` | `fabricationPartSizeMap.IsMappedProductList` | Boolean |
| `Boolean IsProductList { get; set; }` | `fabricationPartSizeMap.IsProductList` | Boolean |
| `Boolean IsValidObject { get; }` | `fabricationPartSizeMap.IsValidObject` | Boolean |
| `Double MappedDepth { get; set; }` | `fabricationPartSizeMap.MappedDepth` | Double |
| `ConnectorProfileType MappedProfileType { get; set; }` | `fabricationPartSizeMap.MappedProfileType` | ConnectorProfileType |
| `Int32 MappedServiceId { get; set; }` | `fabricationPartSizeMap.MappedServiceId` | Int32 |
| `Double MappedWidthDiameter { get; set; }` | `fabricationPartSizeMap.MappedWidthDiameter` | Double |
| `Int32 PaletteId { get; set; }` | `fabricationPartSizeMap.PaletteId` | Int32 |
| `ConnectorProfileType ProfileType { get; set; }` | `fabricationPartSizeMap.ProfileType` | ConnectorProfileType |
| `Int32 ServiceId { get; set; }` | `fabricationPartSizeMap.ServiceId` | Int32 |
| `String SizeString { get; set; }` | `fabricationPartSizeMap.SizeString` | String |
| `Double WidthDiameter { get; set; }` | `fabricationPartSizeMap.WidthDiameter` | Double |
| `Void Dispose()` | `fabricationPartSizeMap.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```